/* 朝代 */
const period_legend = [
  //   ["春秋", -770, -476],
  ["战国", -476, -221],
  ["秦", -221, -202],
  ["西汉", -202, 8],
  ["", 8, 25],
  ["东汉", 25, 220],
  ["三国", 220, 265],
  ["两晋", 265, 420],
  ["南北朝", 420, 581],
  ["隋", 581, 618],
  ["唐", 618, 907],
  ["五代十国", 907, 960],
  ["宋", 960, 1279],
  ["元", 1279, 1368],
  ["明", 1368, 1644],
  ["清", 1644, 1912],
  ["", 1912, 1950], // 民国
];

/* 清代的年号数据 */
const qing_nainhao = [
  ["天命", 1616],
  ["天聪", 1627],
  ["崇德", 1636],
  ["顺治", 1644],
  ["康熙", 1662],
  ["雍正", 1723],
  ["乾隆", 1736],
  ["嘉庆", 1796],
  ["道光", 1821],
  ["咸丰", 1851],
  ["同治", 1862],
  ["光绪", 1875],
  ["宣统", 1909],
];

/* 大事件 */
let big_event = [
  // ['秦末农民起义', -209],
  // ['王莽篡汉', 6],
  // ['光武中兴', 41],
  ["文景之治", -104],
  //   ["夷陵之战", 221],
  ["永嘉之乱", 311],
  ["贞观之治", 627],
  ["安史之乱", 755],
  ["陈桥兵变", 960],
  ["靖康之乱", 1127],
  ["襄阳之战", 1267],
  ["明初大移民", 1370],
  ["满清入关", 1644],
];

export function getPeriodLegend() {
  return period_legend;
}

export function getQingNianhao() {
  return qing_nainhao;
}

export function getBigEvent() {
  return big_event;
}

export function getDynastyName(year) {
  for (let i in period_legend) {
    if (period_legend[i][1] < year && period_legend[i][2] >= year) {
      return period_legend[i][0];
    }
  }
}
